### CHAPTER 7
# Data Cleaning and Preparation

In [4]:
import pandas as pd
import numpy as np

In [5]:
float_data = pd.Series([1.2, -3.5, np.nan, 0])
float_data

0    1.2
1   -3.5
2    NaN
3    0.0
dtype: float64

In [6]:
float_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [7]:
string_data = pd.Series(["aardvark", np.nan, None, "avocado"])
string_data

0    aardvark
1         NaN
2        None
3     avocado
dtype: object

In [8]:
string_data.isnull()

0    False
1     True
2     True
3    False
dtype: bool

In [9]:
float_data = pd.Series([1, 2, None], dtype='float64')
float_data

0    1.0
1    2.0
2    NaN
dtype: float64

In [10]:
float_data.isnull()

0    False
1    False
2     True
dtype: bool

In [11]:
data = pd.Series([1, np.nan, 3.5, np.nan, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [12]:
data[data.notna()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [13]:
data = pd.DataFrame([[1., 6.5, 3.], [1., np.nan, np.nan],
                     [np.nan, np.nan, np.nan], [np.nan, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [14]:
data.dropna()  # Drops any row with NaN values

     0    1    2
0  1.0  6.5  3.0

In [15]:
data.dropna(how='all')  # Drops any row with all NaN values

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [16]:
data[4] = np.nan
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [17]:
data.dropna(axis="columns", how='all')  # Drops any column with all NaN values

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [18]:
df = pd.DataFrame(np.random.standard_normal((7, 3)))
df

          0         1         2
0 -0.362430  1.662878  0.309971
1  0.747521 -0.202627 -1.339273
2 -0.122611 -0.154014  0.027932
3  0.462914 -0.972541  0.904805
4  1.812865 -2.548294  0.566782
5 -1.016809  0.803772  2.391095
6  0.206878 -0.023497 -1.981844

In [19]:
df.iloc[:4, 1] = np.nan
df.iloc[:2, 2] = np.nan
df

          0         1         2
0 -0.362430       NaN       NaN
1  0.747521       NaN       NaN
2 -0.122611       NaN  0.027932
3  0.462914       NaN  0.904805
4  1.812865 -2.548294  0.566782
5 -1.016809  0.803772  2.391095
6  0.206878 -0.023497 -1.981844

In [20]:
df.dropna()

          0         1         2
4  1.812865 -2.548294  0.566782
5 -1.016809  0.803772  2.391095
6  0.206878 -0.023497 -1.981844

In [21]:
df.dropna(thresh=2)  # Keep only rows with at least 2 non-NaN values

          0         1         2
2 -0.122611       NaN  0.027932
3  0.462914       NaN  0.904805
4  1.812865 -2.548294  0.566782
5 -1.016809  0.803772  2.391095
6  0.206878 -0.023497 -1.981844

### Filling In Missing Data

In [22]:
df.fillna(0)  # Fill NaN values with 0

          0         1         2
0 -0.362430  0.000000  0.000000
1  0.747521  0.000000  0.000000
2 -0.122611  0.000000  0.027932
3  0.462914  0.000000  0.904805
4  1.812865 -2.548294  0.566782
5 -1.016809  0.803772  2.391095
6  0.206878 -0.023497 -1.981844

In [23]:
df.fillna({1:0.5, 2:0})  # Fill NaN values in column 1 with 0.5 and column 2 with 0

          0         1         2
0 -0.362430  0.500000  0.000000
1  0.747521  0.500000  0.000000
2 -0.122611  0.500000  0.027932
3  0.462914  0.500000  0.904805
4  1.812865 -2.548294  0.566782
5 -1.016809  0.803772  2.391095
6  0.206878 -0.023497 -1.981844

In [24]:
df = pd.DataFrame(np.random.standard_normal((6, 3)))
df.iloc[2:, 1] = np.nan
df.iloc[4:, 2] = np.nan
df

          0         1         2
0  0.814359 -0.501433 -0.656063
1 -0.854521  0.454609  0.584897
2  1.356167       NaN  0.137630
3  1.960038       NaN -0.267015
4 -2.636051       NaN       NaN
5 -0.710534       NaN       NaN

In [25]:
df.fillna(method='ffill')  # Forward fill NaN values

C:\Users\sahor\AppData\Local\Temp\ipykernel_14156\2883871002.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill')  # Forward fill NaN values

          0         1         2
0  0.814359 -0.501433 -0.656063
1 -0.854521  0.454609  0.584897
2  1.356167  0.454609  0.137630
3  1.960038  0.454609 -0.267015
4 -2.636051  0.454609 -0.267015
5 -0.710534  0.454609 -0.267015

In [26]:
df.fillna(method='ffill', limit=2)  # Forward fill NaN values with a limit of 2

C:\Users\sahor\AppData\Local\Temp\ipykernel_14156\3537515366.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill', limit=2)  # Forward fill NaN values with a limit of 2

          0         1         2
0  0.814359 -0.501433 -0.656063
1 -0.854521  0.454609  0.584897
2  1.356167  0.454609  0.137630
3  1.960038  0.454609 -0.267015
4 -2.636051       NaN -0.267015
5 -0.710534       NaN -0.267015

In [27]:
data = pd.Series([1., np.nan, 3.5, np.nan, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [28]:
data.fillna(data.mean())  # Fill NaN values with the mean of the Series

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## 7.2 Data Transformation

### Removing Duplicates

In [29]:
data = pd.DataFrame({"k1": ["one", "two"] * 3 + ["two"],
                     "k2": [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [30]:
data.duplicated()  # Check for duplicate rows

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [31]:
data.drop_duplicates()  # Drop duplicate rows

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [32]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [33]:
data["v1"] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [34]:
data.drop_duplicates(subset=["k1"])  # Drop duplicates based on column 'k1'

    k1  k2  v1
0  one   1   0
1  two   1   1

In [35]:
data.drop_duplicates(["k1", "k2"], keep="last")  # Drop duplicates based on columns 'k1' and 'k2'

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

### Transforming Data Using a Function or Mapping

In [36]:
data = pd.DataFrame({"food": ["bacon", "pulled pork", "bacon",
                              "pastrami", "corned beef", "bacon",
                              "pastrami", "honey ham", "nova lox"],
                     "ounces": [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [37]:
meat_to_animal = {
 "bacon": "pig",
 "pulled pork": "pig",
 "pastrami": "cow",
 "corned beef": "cow",
 "honey ham": "pig",
 "nova lox": "salmon"
}
data["animal"] = data["food"].map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [38]:
def get_animal(x):
    return meat_to_animal[x]
data["food"].map(get_animal)

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

### Replacing Values

In [39]:
data =pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [40]:
data.replace(-999, np.nan)  # Replace -999 with NaN

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [41]:
data.replace([-999, -1000], np.nan)  # Replace -999 and -1000 with NaN

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [42]:
data.replace([-999, -1000], [np.nan, 0])  # Replace -999 with NaN and -1000 with 0

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [43]:
data.replace({-999:np.nan, -1000:0})  # Replace -999 with NaN and -1000 with 0 using a dictionary

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [44]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

### Renaming Axis Indexes

In [45]:
data = pd.DataFrame(np.arange(12).reshape(3, 4), 
                    index=["Ohio", "Colorado", "New York"],
                    columns=["one", "two", "three", "four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [46]:
def transform(x):
    return x[:4].upper()
data.index = data.index.map(transform)

In [47]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [48]:
data.rename(index=str.title, columns=str.upper)  # Rename index and columns with functions

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [49]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [50]:
data.rename(index={"OHIO": "INDIANA"}, columns={"three": "peekaboo"})  # Rename specific index and column labels

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [51]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

### Discretization and Binning

In [52]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [18, 25, 35, 60, 100]

In [53]:
age_categories = pd.cut(ages, bins)
age_categories

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [54]:
age_categories.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [55]:
age_categories.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [56]:
age_categories.categories[0]

Interval(18, 25, closed='right')

In [57]:
pd.value_counts(age_categories)

C:\Users\sahor\AppData\Local\Temp\ipykernel_14156\3010498523.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(age_categories)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
Name: count, dtype: int64

In [58]:
pd.cut(ages, bins, right=False)  # Left-inclusive bins

[[18, 25), [18, 25), [25, 35), [25, 35), [18, 25), ..., [25, 35), [60, 100), [35, 60), [35, 60), [25, 35)]
Length: 12
Categories (4, interval[int64, left]): [[18, 25) < [25, 35) < [35, 60) < [60, 100)]

In [59]:
group_names = ["Youth", "YoungAdult", "MiddleAged", "Senior"]
pd.cut(ages, bins, labels=group_names)  # Use custom labels for the bins

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [60]:
data = np.random.uniform(size=20)
pd.cut(data, 4, precision=2)  # Cut into 4 equal-width bins with 2 decimal places

[(0.5, 0.73], (0.27, 0.5], (0.73, 0.96], (0.5, 0.73], (0.73, 0.96], ..., (0.27, 0.5], (0.04, 0.27], (0.73, 0.96], (0.5, 0.73], (0.04, 0.27]]
Length: 20
Categories (4, interval[float64, right]): [(0.04, 0.27] < (0.27, 0.5] < (0.5, 0.73] < (0.73, 0.96]]

In [61]:
data = np.random.standard_normal(1000)
quartiles = pd.qcut(data, 4, precision=2)  # Cut into 4 equal-size bins with 2 decimal places
quartiles

[(-3.26, -0.68], (-3.26, -0.68], (-0.0048, 0.66], (0.66, 2.74], (0.66, 2.74], ..., (0.66, 2.74], (-0.68, -0.0048], (-0.68, -0.0048], (0.66, 2.74], (0.66, 2.74]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.26, -0.68] < (-0.68, -0.0048] < (-0.0048, 0.66] < (0.66, 2.74]]

In [62]:
pd.value_counts(quartiles)

C:\Users\sahor\AppData\Local\Temp\ipykernel_14156\3472704981.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(quartiles)

(-3.26, -0.68]      250
(-0.68, -0.0048]    250
(-0.0048, 0.66]     250
(0.66, 2.74]        250
Name: count, dtype: int64

In [63]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.0]).value_counts()

(-3.2479999999999998, -1.255]    100
(-1.255, -0.00485]               400
(-0.00485, 1.312]                400
(1.312, 2.739]                   100
Name: count, dtype: int64

### Detecting and Filtering Outliers

In [64]:
data = pd.DataFrame(np.random.standard_normal((1000, 4)))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.052631    -0.008395     0.002132    -0.007996
std       0.979840     1.002967     1.023814     1.000322
min      -2.722472    -3.623691    -4.040060    -3.817453
25%      -0.611368    -0.686285    -0.689531    -0.692735
50%       0.037528     0.010523     0.001870    -0.009721
75%       0.767393     0.710728     0.694445     0.642027
max       3.603761     3.031357     3.134464     3.207403

In [65]:
col = data[2]
col[col.abs() > 3]

496   -3.328969
510   -3.068772
587    3.134464
755    3.038693
917   -4.040060
Name: 2, dtype: float64

In [66]:
data[(data.abs() > 3).any(axis="columns")]

            0         1         2         3
11  -1.934475 -0.786400 -0.294795 -3.789623
104  0.331107  1.799812  1.148370  3.021202
322  0.849540 -3.623691  1.150902  0.038358
496 -0.642702  1.381460 -3.328969  0.881370
506  0.543599  3.031357 -0.053833  2.375498
510 -0.195998  0.474247 -3.068772  0.104781
565 -1.619120 -1.020194  1.086686  3.207403
587 -0.146928  1.617941  3.134464  0.423510
654  0.779411  3.018398  0.318360 -0.393492
755  1.003468  1.317734  3.038693  1.038585
815  1.835962  0.059539  0.656637 -3.817453
917  0.853667 -2.424069 -4.040060 -0.440909
918  3.603761 -0.072102  1.008349 -0.230427

In [67]:
data[data.abs() > 3] = np.sign(data) * 3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.052027    -0.007821     0.003397    -0.006617
std       0.977834     1.000758     1.018478     0.994134
min      -2.722472    -3.000000    -3.000000    -3.000000
25%      -0.611368    -0.686285    -0.689531    -0.692735
50%       0.037528     0.010523     0.001870    -0.009721
75%       0.767393     0.710728     0.694445     0.642027
max       3.000000     3.000000     3.000000     3.000000

In [68]:
np.sign(data).head()

     0    1    2    3
0  1.0  1.0  1.0  1.0
1 -1.0 -1.0  1.0 -1.0
2  1.0 -1.0 -1.0 -1.0
3  1.0  1.0  1.0  1.0
4 -1.0  1.0  1.0 -1.0

### Permutation and Random Sampling

In [69]:
df = pd.DataFrame(np.arange(5 * 7).reshape((5, 7)))
df

    0   1   2   3   4   5   6
0   0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20
3  21  22  23  24  25  26  27
4  28  29  30  31  32  33  34

In [70]:
sampler = np.random.permutation(5)
sampler

array([0, 3, 1, 4, 2], dtype=int32)

In [71]:
len(df)

5

In [72]:
df.take(sampler)  # Randomly permute the rows of the DataFrame

    0   1   2   3   4   5   6
0   0   1   2   3   4   5   6
3  21  22  23  24  25  26  27
1   7   8   9  10  11  12  13
4  28  29  30  31  32  33  34
2  14  15  16  17  18  19  20

In [73]:
df.iloc[sampler]  # Randomly permute the rows of the DataFrame

    0   1   2   3   4   5   6
0   0   1   2   3   4   5   6
3  21  22  23  24  25  26  27
1   7   8   9  10  11  12  13
4  28  29  30  31  32  33  34
2  14  15  16  17  18  19  20

In [74]:
df.sample(n=3)  # Randomly sample 3 rows from the DataFrame

    0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20
0   0   1   2   3   4   5   6

In [75]:
choices = pd.Series([5, 7, -1, 6, 4])
choices

0    5
1    7
2   -1
3    6
4    4
dtype: int64

In [76]:
choices.sample(n=10, replace=True)  # Sample with replacement

2   -1
3    6
0    5
2   -1
1    7
4    4
3    6
1    7
1    7
1    7
dtype: int64

In [77]:
choices

0    5
1    7
2   -1
3    6
4    4
dtype: int64

### Computing Indicator/Dummy Variables

In [78]:
df = pd.DataFrame({"key": ["b", "b", "a", "c", "a", "b"],
                   "data1": range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [79]:
pd.get_dummies(df["key"]).astype(int)  # One-hot encoding

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [80]:
dummies = pd.get_dummies(df["key"], prefix="key", dtype=int)  # Prefix for the column names
dummies

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

In [81]:
df_with_dummy = df[["data1"]].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [82]:
mnames = ["movie_id", "title", "genres"]
movies = pd.read_table("datasets/movielens/movies.dat", sep="::",
                       header=None, names=mnames, engine="python",
                       encoding="latin-1")
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [83]:
dummies = movies["genres"].str.get_dummies("|")
dummies.iloc[:10, :6]

   Action  Adventure  Animation  Children's  Comedy  Crime
0       0          0          1           1       1      0
1       0          1          0           1       0      0
2       0          0          0           0       1      0
3       0          0          0           0       1      0
4       0          0          0           0       1      0
5       1          0          0           0       0      1
6       0          0          0           0       1      0
7       0          1          0           1       0      0
8       1          0          0           0       0      0
9       1          1          0           0       0      0

In [84]:
movies_windic = movies.join(dummies.add_prefix("Genre_"))
movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Action                                   0
Genre_Adventure                                0
Genre_Animation                                1
Genre_Children's                               1
Genre_Comedy                                   1
Genre_Crime                                    0
Genre_Documentary                              0
Genre_Drama                                    0
Genre_Fantasy                                  0
Genre_Film-Noir                                0
Genre_Horror                                   0
Genre_Musical                                  0
Genre_Mystery                                  0
Genre_Romance                                  0
Genre_Sci-Fi                                   0
Genre_Thriller                                 0
Genre_War                                      0
Genre_Western                                  0
Name: 0, dtype: object

In [85]:
np.random.seed(12345)
values = np.random.uniform(size=10)
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [86]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]
pd.get_dummies(pd.cut(values, bins), dtype=int)

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

## 7.3 Extension Data Types

In [87]:
s = pd.Series([1, 2, 3, None])
s

0    1.0
1    2.0
2    3.0
3    NaN
dtype: float64

In [88]:
s = pd.Series([1, 2, 3, None], dtype=pd.Int64Dtype())
s

0       1
1       2
2       3
3    <NA>
dtype: Int64

In [89]:
s.isna()

0    False
1    False
2    False
3     True
dtype: bool

In [90]:
s.dtype

Int64Dtype()

In [91]:
s[3] is pd.NA

True

In [92]:
s = pd.Series([1, 2, 3, None], dtype="Int64")
s

0       1
1       2
2       3
3    <NA>
dtype: Int64

In [93]:
s = pd.Series(['one', 'two', None, 'three'], dtype=pd.StringDtype())
s

0      one
1      two
2     <NA>
3    three
dtype: string

In [94]:
df = pd.DataFrame({"A": [1, 2, None, 4],
                   "B": ["one", "two", "three", None],
                   "c": [False, None, False, True]})
df

     A      B      c
0  1.0    one  False
1  2.0    two   None
2  NaN  three  False
3  4.0   None   True

In [95]:
df["A"] = df["A"].astype("Int64")
df["B"] = df["B"].astype("string")
df["c"] = df["c"].astype("boolean")
df

      A      B      c
0     1    one  False
1     2    two   <NA>
2  <NA>  three  False
3     4   <NA>   True

## 7.4 String Manipulation

### Python Built-In String Object Methods

In [96]:
val = "a,b,  guido"
val.split(",")

['a', 'b', '  guido']

In [97]:
pieces = [x.strip() for x in val.split(",")]
pieces

['a', 'b', 'guido']

In [98]:
first, second, third = pieces
first + "::" + second + "::" + third

'a::b::guido'

In [99]:
"::".join(pieces)

'a::b::guido'

In [100]:
"guido" in val

True

In [103]:
val.index(",")

1

In [104]:
val.find(":")

-1

In [105]:
val.count(",")

2

In [106]:
val.replace(",", "::")

'a::b::  guido'

In [107]:
val.replace(",", "")

'ab  guido'

In [110]:
val.split()

['a,b,', 'guido']